# -*- coding: utf-8 -*-
# @Time : 2019/12/3 15:53
# @Author : EDZ
# @Email : wangdexin@haxitag.com
# @File : ss.py
# @Project : test
'''
pp
'''




sss="7月22日下午，《财富》发布2019年世界500强榜单，小米以2018年销售额1749亿元的销售收入首次上榜，排名第468位；在全球“互联网服务和零售”公司中小米排名第7，也成为继京东、阿里巴巴、腾讯之后第4家上榜的中国互联网企业。 再次创业的雷军，用9年时间将小米带入世界500强，小米也是500强中最年轻的一家，是截至目前上榜速度最快的中国互联网科技公司。 “耶，世界500强！虽然很想假装‘世界500强不算啥’，但按耐不住的激动……”榜单揭晓后，雷军迅速在微博中回应。 从四十出发的创业之年，到五十而知天命的收获之年，雷军实现的不只是个人的梦想，也是在一个创业创新的时代，有理想、有创新、有奋斗、有收获的中国梦想。 中国的山是高山，中国的路是大路，高山可攀，大路当行。创新中国为小米提供了时代红利，小米为中国创造了创新标杆。 中国与世界 1995年，涵盖了工业类企业和服务业企业的世界财富500强首次发布，中国有3家公司上榜，即中国银行、中化集团及中粮集团。当时，中国台湾和中国香港地区尚无一家公司上榜。那一年，日本上榜公司有149家，和美国只有2家之差，而从上榜公司的总收入看，日本还比美国多28%，名列第一。那是美日公司并驾齐驱的时代。 24年之后的今天，中国公司的数量（含台湾和香港）达到129家，超过美国的121家。可以预计，今后相当长时间内，世界500强的中国公司将越来越多 中俄 时政外交 俄罗斯联邦 关系民主化 中俄内部事务 美国 中国 中华 王毅 杨洁篪 俄罗斯 帕特鲁舍夫 郭声琨 利用战略 两国经济社会 俄中两国 人民大会堂 普京 习近平 步伐俄罗斯 中俄 时政外交 俄罗斯联邦 关系民主化 中俄内部事务 美国 中国 中华 王毅 杨洁篪 俄罗斯 帕特鲁舍夫 郭声琨 利用战略 两国经济社会 俄中两国 人民大会堂 普京 习近平 步伐俄罗斯"
print(len(sss))
